hw2/rails-intro/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.get_ratings
    @movies = Movie.scoped
    sort_column = sort_by_column((params[:sort_by] || session[:sort_by]))
    @movies = @movies.order(sort_column) if !sort_column.nil?

    ratings = (params[:ratings] || session[:ratings])
    if params[:commit] == "Refresh"
      if !ratings.nil?
        @movies = @movies.where(rating: params[:ratings].keys)
---
SELECT "movies".* FROM "movies" WHERE (rating like'G','R')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13') ORDER BY release_date